In [72]:
import pandas as pd

In [80]:
input_file = 'supplier_data.csv'
output_file = 'output_files/3output_pandas.csv'

In [74]:
df_supplier = pd.read_csv(input_file)
df_supplier

   Supplier Name Invoice Number  Part Number     Cost Purchase Date
0     Supplier X       001-1001         2341  $500.00       1/20/14
1     Supplier X       001-1001         2341  $500.00       1/20/14
2     Supplier X       001-1001         5467  $750.00       1/20/14
3     Supplier X       001-1001         5467  $750.00       1/20/14
4     Supplier Y        50-9501         7009  $250.00       1/30/14
5     Supplier Y        50-9501         7009  $250.00       1/30/14
6     Supplier Y        50-9505         6650  $125.00        2/3/14
7     Supplier Y        50-9505         6650  $125.00        2/3/14
8     Supplier Z       920-4803         3321  $610.00        2/3/14
9     Supplier Z       920-4804         3321  $615.00       2/10/14
10    Supplier Z       920-4805         3321  $615.00       2/17/14
11    Supplier Z       920-4806         3321  $615.00       2/24/14

In [75]:
 df_supplier['Cost'] = df_supplier['Cost'].str.strip('$').astype('float64')

In [76]:
df_supplier.loc[((df_supplier['Supplier Name'] == 'Supplier Y')),:]

  Supplier Name Invoice Number  Part Number   Cost Purchase Date
4    Supplier Y        50-9501         7009  250.0       1/30/14
5    Supplier Y        50-9501         7009  250.0       1/30/14
6    Supplier Y        50-9505         6650  125.0        2/3/14
7    Supplier Y        50-9505         6650  125.0        2/3/14

In [77]:
df_supplier.loc[df_supplier['Cost'] < 200.0, :]

  Supplier Name Invoice Number  Part Number   Cost Purchase Date
6    Supplier Y        50-9505         6650  125.0        2/3/14
7    Supplier Y        50-9505         6650  125.0        2/3/14

In [78]:
result = df_supplier.loc[(df_supplier['Supplier Name'] == 'Supplier Y') &
                         (df_supplier['Cost'] < 200.0), :]
result

  Supplier Name Invoice Number  Part Number   Cost Purchase Date
6    Supplier Y        50-9505         6650  125.0        2/3/14
7    Supplier Y        50-9505         6650  125.0        2/3/14

In [81]:
result.to_csv(output_file, index = False)